Autodesk.Revit.DB.Structure.BoundaryConditionsOrientTo
Specifies boundary condition orientation.
Since:
2015
Since:
2015

Autodesk.Revit.DB.Structure.BoundaryConditionsOrientTo.HostLocalCoordinateSystem
Boundary condition is oriented in respect to it analytical host element coordinate system and will follow host changes.

Autodesk.Revit.DB.Structure.BoundaryConditionsOrientTo.Project
Boundary condition is oriented in respect to project global coordinate system, that is X to East, Y to North, and Z to up.